STMicroelectronics/STM32CubeWB/Projects/P-NUCLEO-WB55.Nucleo/Applications/BLE/BLE_AT_Server/STM32_WPAN/App/app_ble.c
/* Private function prototypes -----------------------------------------------*/
static void BLE_UserEvtRx( void * pPayload );
static void BLE_StatusNot( HCI_TL_CmdStatus_t status );
static void Ble_Tl_Init( void );
static void Ble_Hci_Gap_Gatt_Init(void);
const uint8_t* BleGetBdAddress( void );
static void Adv_Request( APP_BLE_ConnStatus_t New_Status );
static void Add_Advertisment_Service_UUID( uint16_t servUUID );
static void Adv_Mgr( void );
static void Switch_OFF_GPIO( void );

#if(L2CAP_REQUEST_NEW_CONN_PARAM != 0)
static void BLE_SVC_L2CAP_Conn_Update(uint16_t Connection_Handle);
static void Connection_Interval_Update_Req( void );
#endif

/* USER CODE BEGIN PFP */

extern HRSAPP_Context_t HRSAPP_Context;

static void Manage_Start_Stop_Adv_Init(void);
static void Manage_Service_Init(void);
static void Manage_Update_Connection(void);
static void Manage_Update_Charac(void);
static void Manage_Indication_Update_Charac(void);
static void Manage_Custom_Service_Init(void);
static void Manage_Charac_Init(void);
static void Manage_Slave_Security_Request(void);
static void Manage_Pairing_Confirm_Answer(void);
static void Manage_Pass_Key_Resp(void);
static void Manage_IO_Capability(void);
static void Manage_set_authen_req(void);
static void Manage_clear_db(void);
static void Manage_hci_reset(void);
static void Manage_Ble_Init(void);

/* USER CODE END PFP */

/* Functions Definition ------------------------------------------------------*/
void APP_BLE_Init( void )
{
  SHCI_CmdStatus_t status;
  uint8_t i,j;
/* USER CODE BEGIN APP_BLE_Init_1 */

/* USER CODE END APP_BLE_Init_1 */
  SHCI_C2_Ble_Init_Cmd_Packet_t ble_init_cmd_packet =
  {
    {{0,0,0}},                          /**< Header unused */
    {0,                                 /** pBleBufferAddress not used */
     0,                                 /** BleBufferSize not used */
     CFG_BLE_NUM_GATT_ATTRIBUTES,
     CFG_BLE_NUM_GATT_SERVICES,
     CFG_BLE_ATT_VALUE_ARRAY_SIZE,
     CFG_BLE_NUM_LINK,
     CFG_BLE_DATA_LENGTH_EXTENSION,
     CFG_BLE_PREPARE_WRITE_LIST_SIZE,
     CFG_BLE_MBLOCK_COUNT,
     CFG_BLE_MAX_ATT_MTU,
     CFG_BLE_SLAVE_SCA,
     CFG_BLE_MASTER_SCA,
     CFG_BLE_LS_SOURCE,
     CFG_BLE_MAX_CONN_EVENT_LENGTH,
     CFG_BLE_HSE_STARTUP_TIME,
     CFG_BLE_VITERBI_MODE,
     CFG_BLE_OPTIONS,
     0,
     CFG_BLE_MAX_COC_INITIATOR_NBR,
     CFG_BLE_MIN_TX_POWER,
     CFG_BLE_MAX_TX_POWER,
     CFG_BLE_RX_MODEL_CONFIG,
     CFG_BLE_MAX_ADV_SET_NBR,
     CFG_BLE_MAX_ADV_DATA_LEN,
     CFG_BLE_TX_PATH_COMPENS,
     CFG_BLE_RX_PATH_COMPENS,
     CFG_BLE_CORE_VERSION
    }
  };

  /**
   * Initialize Ble Transport Layer
   */
  Ble_Tl_Init( );

  /**
   * Do not allow standby in the application
   */
  UTIL_LPM_SetOffMode(1 << CFG_LPM_APP_BLE, UTIL_LPM_DISABLE);

  /**
   * Register the hci transport layer to handle BLE User Asynchronous Events
   */
  UTIL_SEQ_RegTask( 1<<CFG_TASK_HCI_ASYNCH_EVT_ID, UTIL_SEQ_RFU, hci_user_evt_proc);

  /**
   * Starts the BLE Stack on CPU2
   */
  status = SHCI_C2_BLE_Init(&ble_init_cmd_packet);
  if (status != SHCI_Success)
  {
    APP_DBG_MSG("  Fail   : SHCI_C2_BLE_Init command, result: 0x%02x\n\r", status);
    /* if you are here, maybe CPU2 doesn't contain STM32WB_Copro_Wireless_Binaries, see Release_Notes.html */
    Error_Handler();
  }
  else
  {
    APP_DBG_MSG("  Success: SHCI_C2_BLE_Init command\n\r");
  }

  /* Initialization of custom services and characteristics handles */ 
  for (i = 0 ; i < CUSTOM_APP_SVC_COUNT ; i++)
  {
    Custom_Context.SvcHdle[i] = 0;
    for (j = 0 ; j < CUSTOM_APP_CHAR_COUNT ; j++)
    {
      Custom_Context.CharHdle[i][j] = 0;
    }
  }
  
  /* start/stop advertising */
  UTIL_SEQ_RegTask( 1<<CFG_TASK_MANAGE_START_STOP_ADV_ID, UTIL_SEQ_RFU, Manage_Start_Stop_Adv_Init);
  /* start init */
  UTIL_SEQ_RegTask( 1<<CFG_TASK_MANAGE_INIT_ID, UTIL_SEQ_RFU, Manage_Ble_Init);
  /* P2P_server or Heart rate */
  UTIL_SEQ_RegTask( 1<<CFG_TASK_MANAGE_SERVICE_INIT_ID, UTIL_SEQ_RFU, Manage_Service_Init);
  /* Custom Service */
  UTIL_SEQ_RegTask( 1<<CFG_TASK_MANAGE_CUSTOM_SERVICE_INIT_ID, UTIL_SEQ_RFU, Manage_Custom_Service_Init);
  /* Custom Charac */
  UTIL_SEQ_RegTask( 1<<CFG_TASK_MANAGE_CHARAC_INIT_ID, UTIL_SEQ_RFU, Manage_Charac_Init);
  /* Slave Security Request */
  UTIL_SEQ_RegTask( 1<<CFG_TASK_MANAGE_SLAVE_SECUTITY_REQ_ID, UTIL_SEQ_RFU, Manage_Slave_Security_Request);
  /* Pairing Confirm Answer */
  UTIL_SEQ_RegTask( 1<<CFG_TASK_PAIRING_CONFIRM_ID, UTIL_SEQ_RFU, Manage_Pairing_Confirm_Answer);
  /* Pass_Key_Resp */
  UTIL_SEQ_RegTask( 1<<CFG_TASK_PASS_KEY_RESP_ID, UTIL_SEQ_RFU, Manage_Pass_Key_Resp);
  /* io_capability */
  UTIL_SEQ_RegTask( 1<<CFG_TASK_IO_CAPA_ID, UTIL_SEQ_RFU, Manage_IO_Capability);
  /* authentication_req */
  UTIL_SEQ_RegTask( 1<<CFG_TASK_SET_AUTHEN_REQ_ID, UTIL_SEQ_RFU, Manage_set_authen_req);
  /* clear_security_db */
  UTIL_SEQ_RegTask( 1<<CFG_TASK_CLEAR_DB_ID, UTIL_SEQ_RFU, Manage_clear_db);
  /* hci_reset */
  UTIL_SEQ_RegTask( 1<<CFG_TASK_HCIRESET_ID, UTIL_SEQ_RFU, Manage_hci_reset);
  /* Connection interval update */
  UTIL_SEQ_RegTask( 1<<CFG_TASK_MANAGE_CONN_PARAM_ID, UTIL_SEQ_RFU, Manage_Update_Connection);
  /* notification update*/
  UTIL_SEQ_RegTask( 1<<CFG_TASK_UPDATE_CHAR_ID, UTIL_SEQ_RFU, Manage_Update_Charac);  
  /* indication update */
  UTIL_SEQ_RegTask( 1<<CFG_TASK_INDICATION_UPDATE_CHAR_ID, UTIL_SEQ_RFU, Manage_Indication_Update_Charac);

  /**
   * Create timer to handle the connection state machine
   */

  HW_TS_Create(CFG_TIM_PROC_ID_ISR, &(BleApplicationContext.Advertising_mgr_timer_Id), hw_ts_SingleShot, Adv_Mgr);

  /**
   * Create timer to handle the Led Switch OFF
   */
  HW_TS_Create(CFG_TIM_PROC_ID_ISR, &(BleApplicationContext.SwitchOffGPIO_timer_Id), hw_ts_SingleShot, Switch_OFF_GPIO);
}

SVCCTL_UserEvtFlowStatus_t SVCCTL_App_Notification( void *pckt ) 
{
  hci_event_pckt *event_pckt;
  evt_le_meta_event *meta_evt;
  evt_blecore_aci *blecore_evt;
  hci_le_phy_update_complete_event_rp0 *evt_le_phy_update_complete;
  hci_le_connection_update_complete_event_rp0 *connection_update_complete_event;
  uint8_t TX_PHY, RX_PHY;
  tBleStatus ret = BLE_STATUS_INVALID_PARAMS;
  stm32wb_at_BLE_EVT_CONN_t param_BLE_EVT_CONN;
  stm32wb_at_BLE_EVT_UPD_CONN_t param_BLE_EVT_UPD_CONN;
  stm32wb_at_BLE_EVT_PASSKEY_REQ_t param_BLE_EVT_PASSKEY_REQ;
  stm32wb_at_BLE_EVT_VALUE_CONFIRM_t param_BLE_EVT_NUMERIC_VALUE;
  stm32wb_at_BLE_EVT_PAIRING_t param_BLE_EVT_PAIRING;

