STMicroelectronics/STM32CubeWB/Projects/P-NUCLEO-WB55.Nucleo/Applications/BLE/BLE_AT_Server/STM32_WPAN/App/app_ble.c
  event_pckt = (hci_event_pckt*) ((hci_uart_pckt *) pckt)->data;

  /* USER CODE BEGIN SVCCTL_App_Notification */

  /* USER CODE END SVCCTL_App_Notification */

  switch (event_pckt->evt)
  {
    case HCI_DISCONNECTION_COMPLETE_EVT_CODE:
    {
      hci_disconnection_complete_event_rp0 *disconnection_complete_event;
      disconnection_complete_event = (hci_disconnection_complete_event_rp0 *) event_pckt->data;

      if (disconnection_complete_event->Connection_Handle == BleApplicationContext.BleApplicationContext_legacy.connectionHandle)
      {
        BleApplicationContext.BleApplicationContext_legacy.connectionHandle = 0;
        BleApplicationContext.Device_Connection_Status = APP_BLE_IDLE;
        global_conn_int_min = 0;
        global_conn_int_max = 0;

        printf("\r\n\r** DISCONNECTION EVENT WITH CLIENT \n");
        param_BLE_EVT_CONN.status = 0;
        ble_at_server_Send_evt(BLE_EVT_CONN, &param_BLE_EVT_CONN);
      }

      /* USER CODE BEGIN EVT_DISCONN_COMPLETE */

      /* USER CODE END EVT_DISCONN_COMPLETE */
    }

    break; /* HCI_DISCONNECTION_COMPLETE_EVT_CODE */

    case HCI_LE_META_EVT_CODE:
    {
      meta_evt = (evt_le_meta_event*) event_pckt->data;

      /* USER CODE BEGIN EVT_LE_META_EVENT */

      /* USER CODE END EVT_LE_META_EVENT */
      switch (meta_evt->subevent)
      {
        case HCI_LE_CONNECTION_UPDATE_COMPLETE_SUBEVT_CODE:
          printf("\r\n\r** CONNECTION UPDATE EVENT WITH CLIENT \n");
          connection_update_complete_event = (hci_le_connection_update_complete_event_rp0*) meta_evt->data;
          global_conn_int_min = (uint8_t)(connection_update_complete_event->Conn_Interval)*1.25;
          global_conn_int_max = (uint8_t)(connection_update_complete_event->Conn_Interval)*1.25;
          
          param_BLE_EVT_UPD_CONN.status = 1;
          ble_at_server_Send_evt(BLE_EVT_UPD_CONN, &param_BLE_EVT_UPD_CONN);

          /* USER CODE BEGIN EVT_LE_CONN_UPDATE_COMPLETE */

          /* USER CODE END EVT_LE_CONN_UPDATE_COMPLETE */
          break;
        case HCI_LE_PHY_UPDATE_COMPLETE_SUBEVT_CODE:
          printf("EVT_UPDATE_PHY_COMPLETE \n");
          evt_le_phy_update_complete = (hci_le_phy_update_complete_event_rp0*)meta_evt->data;
          if (evt_le_phy_update_complete->Status == 0)
          {
            APP_DBG_MSG("EVT_UPDATE_PHY_COMPLETE, status ok \n");
          }
          else
          {
            APP_DBG_MSG("EVT_UPDATE_PHY_COMPLETE, status nok \n");
          }

          ret = hci_le_read_phy(BleApplicationContext.BleApplicationContext_legacy.connectionHandle,&TX_PHY,&RX_PHY);
          if (ret == BLE_STATUS_SUCCESS)
          {
            printf("Read_PHY success \n");

            if ((TX_PHY == TX_2M) && (RX_PHY == RX_2M))
            {
              printf("PHY Param  TX= %d, RX= %d \n", TX_PHY, RX_PHY);
            }
            else
            {
              printf("PHY Param  TX= %d, RX= %d \n", TX_PHY, RX_PHY);
            }
          }
          else
          {
            printf("Read conf not success \n");
          }
          /* USER CODE BEGIN EVT_LE_PHY_UPDATE_COMPLETE */

          /* USER CODE END EVT_LE_PHY_UPDATE_COMPLETE */
          break;
        case HCI_LE_CONNECTION_COMPLETE_SUBEVT_CODE:
        {
          hci_le_connection_complete_event_rp0 *connection_complete_event;

          /**
           * The connection is done, there is no need anymore to schedule the LP ADV
           */
          connection_complete_event = (hci_le_connection_complete_event_rp0 *) meta_evt->data;
          global_conn_int_min = (uint8_t)(connection_complete_event->Conn_Interval);
          global_conn_int_max = (uint8_t)(connection_complete_event->Conn_Interval);

          HW_TS_Stop(BleApplicationContext.Advertising_mgr_timer_Id);

          printf("HCI_LE_CONNECTION_COMPLETE_SUBEVT_CODE for connection handle 0x%x\n", connection_complete_event->Connection_Handle);
          if (BleApplicationContext.Device_Connection_Status == APP_BLE_LP_CONNECTING)
          {
            /* Connection as client */
            BleApplicationContext.Device_Connection_Status = APP_BLE_CONNECTED_CLIENT;
          }
          else
          {
            /* Connection as server */
            BleApplicationContext.Device_Connection_Status = APP_BLE_CONNECTED_SERVER;
          }

          param_BLE_EVT_CONN.status = 1;
          ble_at_server_Send_evt(BLE_EVT_CONN, &param_BLE_EVT_CONN);

          BleApplicationContext.BleApplicationContext_legacy.connectionHandle = connection_complete_event->Connection_Handle;
          ret = aci_gatt_exchange_config(connection_complete_event->Connection_Handle);
          if (ret == BLE_STATUS_SUCCESS)
          {
            printf("exchange_config, Successfully \r\n\r");
          }
          else
          {
            printf("exchange_config, Failed \r\n\r");
          }
          /* USER CODE BEGIN HCI_EVT_LE_CONN_COMPLETE */

          /* USER CODE END HCI_EVT_LE_CONN_COMPLETE */
        }
        break; /* HCI_LE_CONNECTION_COMPLETE_SUBEVT_CODE */

        /* USER CODE BEGIN META_EVT */

        /* USER CODE END META_EVT */

        default:
          /* USER CODE BEGIN SUBEVENT_DEFAULT */

          /* USER CODE END SUBEVENT_DEFAULT */
          break;
      }
    }
    break; /* HCI_LE_META_EVT_CODE */

    case HCI_VENDOR_SPECIFIC_DEBUG_EVT_CODE:
      blecore_evt = (evt_blecore_aci*) event_pckt->data;
      /* USER CODE BEGIN EVT_VENDOR */

      /* USER CODE END EVT_VENDOR */
      switch (blecore_evt->ecode)
      {
      /* USER CODE BEGIN ecode */
        aci_gap_pairing_complete_event_rp0 *pairing_complete;

      case ACI_GAP_LIMITED_DISCOVERABLE_VSEVT_CODE:
        APP_DBG_MSG("\r\n\r** ACI_GAP_LIMITED_DISCOVERABLE_VSEVT_CODE \n");
          break; /* ACI_GAP_LIMITED_DISCOVERABLE_VSEVT_CODE */
      case ACI_GAP_PASS_KEY_REQ_VSEVT_CODE:
        param_BLE_EVT_PASSKEY_REQ.dummy = 1;
        ble_at_server_Send_evt(BLE_EVT_PASSKEY_REQ, &param_BLE_EVT_PASSKEY_REQ);
          break; /* ACI_GAP_PASS_KEY_REQ_VSEVT_CODE */
      case ACI_GAP_AUTHORIZATION_REQ_VSEVT_CODE:
          break; /* ACI_GAP_AUTHORIZATION_REQ_VSEVT_CODE */
      case ACI_GAP_SLAVE_SECURITY_INITIATED_VSEVT_CODE:
          break; /* ACI_GAP_SLAVE_SECURITY_INITIATED_VSEVT_CODE */
      case ACI_GAP_BOND_LOST_VSEVT_CODE:
          break; /* ACI_GAP_BOND_LOST_VSEVT_CODE */
      case ACI_GAP_ADDR_NOT_RESOLVED_VSEVT_CODE:
          break; /* ACI_GAP_ADDR_NOT_RESOLVED_VSEVT_CODE */
      case (ACI_GAP_KEYPRESS_NOTIFICATION_VSEVT_CODE):        
        break; /* ACI_GAP_KEYPRESS_NOTIFICATION_VSEVT_CODE */
      case (ACI_GAP_NUMERIC_COMPARISON_VALUE_VSEVT_CODE):
          param_BLE_EVT_NUMERIC_VALUE.numeric_value = ((aci_gap_numeric_comparison_value_event_rp0 *)(blecore_evt->data))->Numeric_Value;  
          
          ble_at_server_Send_evt(BLE_EVT_VALUE_CONFIRM, &param_BLE_EVT_NUMERIC_VALUE);
        break;
      case (ACI_GAP_PAIRING_COMPLETE_VSEVT_CODE):
        {
            pairing_complete = (aci_gap_pairing_complete_event_rp0*)blecore_evt->data;
            param_BLE_EVT_PAIRING.status = pairing_complete->Status;  
            param_BLE_EVT_PAIRING.reason = pairing_complete->Reason;
            
            ble_at_server_Send_evt(BLE_EVT_PAIRING, &param_BLE_EVT_PAIRING);
        }
        break;
          
      /* USER CODE END ecode */
      /**
       * SPECIFIC to P2P Server APP
       */
        case ACI_L2CAP_CONNECTION_UPDATE_RESP_VSEVT_CODE:
#if (L2CAP_REQUEST_NEW_CONN_PARAM != 0 )
          mutex = 1;
#endif
      /* USER CODE BEGIN EVT_BLUE_L2CAP_CONNECTION_UPDATE_RESP */

      /* USER CODE END EVT_BLUE_L2CAP_CONNECTION_UPDATE_RESP */
      break;
        case ACI_GAP_PROC_COMPLETE_VSEVT_CODE:
        APP_DBG_MSG("\r\n\r** ACI_GAP_PROC_COMPLETE_VSEVT_CODE \n");
        /* USER CODE BEGIN EVT_BLUE_GAP_PROCEDURE_COMPLETE */

        /* USER CODE END EVT_BLUE_GAP_PROCEDURE_COMPLETE */
          break; /* ACI_GAP_PROC_COMPLETE_VSEVT_CODE */
#if(RADIO_ACTIVITY_EVENT != 0)
        case ACI_HAL_END_OF_RADIO_ACTIVITY_VSEVT_CODE:
        /* USER CODE BEGIN RADIO_ACTIVITY_EVENT*/
          BSP_LED_On(LED_GREEN);
          HW_TS_Start(BleApplicationContext.SwitchOffGPIO_timer_Id, (uint32_t)LED_ON_TIMEOUT);
        /* USER CODE END RADIO_ACTIVITY_EVENT*/
          break; /* ACI_HAL_END_OF_RADIO_ACTIVITY_VSEVT_CODE */
#endif

