STMicroelectronics/STM32CubeWB/Projects/P-NUCLEO-WB55.Nucleo/Applications/BLE/BLE_AT_Server/STM32_WPAN/App/app_ble.c
  udn = LL_FLASH_GetUDN();

  if(udn != 0xFFFFFFFF)
  {
    company_id = LL_FLASH_GetSTCompanyID();
    device_id = LL_FLASH_GetDeviceID();

/**
 * Public Address with the ST company ID
 * bit[47:24] : 24bits (OUI) equal to the company ID
 * bit[23:16] : Device ID.
 * bit[15:0] : The last 16bits from the UDN
 * Note: In order to use the Public Address in a final product, a dedicated
 * 24bits company ID (OUI) shall be bought.
 */
    bd_addr_udn[0] = (uint8_t)(udn & 0x000000FF);
    bd_addr_udn[1] = (uint8_t)( (udn & 0x0000FF00) >> 8 );
    bd_addr_udn[2] = (uint8_t)device_id;
    bd_addr_udn[3] = (uint8_t)(company_id & 0x000000FF);
    bd_addr_udn[4] = (uint8_t)( (company_id & 0x0000FF00) >> 8 );
    bd_addr_udn[5] = (uint8_t)( (company_id & 0x00FF0000) >> 16 );

    bd_addr = (const uint8_t *)bd_addr_udn;
  }
  else
  {
    otp_addr = OTP_Read(0);
    if(otp_addr)
    {
      bd_addr = ((OTP_ID0_t*)otp_addr)->bd_address;
    }
    else
    {
      bd_addr = M_bd_addr;
    }
  }

  return bd_addr;
}

/* USER CODE BEGIN FD_LOCAL_FUNCTION */

/* USER CODE END FD_LOCAL_FUNCTION */

/*************************************************************
 *
 *SPECIFIC FUNCTIONS
 *
 *************************************************************/
static void Add_Advertisment_Service_UUID( uint16_t servUUID )
{
  BleApplicationContext.BleApplicationContext_legacy.advtServUUID[BleApplicationContext.BleApplicationContext_legacy.advtServUUIDlen] =
      (uint8_t) (servUUID & 0xFF);
  BleApplicationContext.BleApplicationContext_legacy.advtServUUIDlen++;
  BleApplicationContext.BleApplicationContext_legacy.advtServUUID[BleApplicationContext.BleApplicationContext_legacy.advtServUUIDlen] =
      (uint8_t) (servUUID >> 8) & 0xFF;
  BleApplicationContext.BleApplicationContext_legacy.advtServUUIDlen++;

  return;
}

static void Adv_Mgr( void )
{
  /**
   * The code shall be executed in the background as an aci command may be sent
   * The background is the only place where the application can make sure a new aci command
   * is not sent if there is a pending one
   */
  UTIL_SEQ_SetTask(1 << CFG_TASK_ADV_UPDATE_ID, CFG_SCH_PRIO_0);

  return;
}

/*************************************************************
 *
 *SPECIFIC FUNCTIONS FOR P2P SERVER
 *
 *************************************************************/
static void Switch_OFF_GPIO(){
/* USER CODE BEGIN Switch_OFF_GPIO */
  BSP_LED_Off(LED_GREEN);
/* USER CODE END Switch_OFF_GPIO */
}

#if(L2CAP_REQUEST_NEW_CONN_PARAM != 0)
void BLE_SVC_L2CAP_Conn_Update(uint16_t Connection_Handle)
{
/* USER CODE BEGIN BLE_SVC_L2CAP_Conn_Update_1 */

/* USER CODE END BLE_SVC_L2CAP_Conn_Update_1 */
  if(mutex == 1) {
    mutex = 0;
    index_con_int = (index_con_int + 1)%SIZE_TAB_CONN_INT;
    uint16_t interval_min = CONN_P(tab_conn_interval[index_con_int]);
    uint16_t interval_max = CONN_P(tab_conn_interval[index_con_int]);
    uint16_t slave_latency = L2CAP_SLAVE_LATENCY;
    uint16_t timeout_multiplier = L2CAP_TIMEOUT_MULTIPLIER;
    tBleStatus result;

    result = aci_l2cap_connection_parameter_update_req(BleApplicationContext.BleApplicationContext_legacy.connectionHandle,
                                                       interval_min, interval_max,
                                                       slave_latency, timeout_multiplier);
    if( result == BLE_STATUS_SUCCESS )
    {
      APP_DBG_MSG("BLE_SVC_L2CAP_Conn_Update(), Successfully \r\n\r");
    }
    else
    {
      APP_DBG_MSG("BLE_SVC_L2CAP_Conn_Update(), Failed \r\n\r");
    }
  }
/* USER CODE BEGIN BLE_SVC_L2CAP_Conn_Update_2 */

/* USER CODE END BLE_SVC_L2CAP_Conn_Update_2 */
  return;
}
#endif

#if (L2CAP_REQUEST_NEW_CONN_PARAM != 0 )
static void Connection_Interval_Update_Req( void )
{
  if (BleApplicationContext.Device_Connection_Status != APP_BLE_FAST_ADV && BleApplicationContext.Device_Connection_Status != APP_BLE_IDLE)
  {
    BLE_SVC_L2CAP_Conn_Update(BleApplicationContext.BleApplicationContext_legacy.connectionHandle);
  }
  
  return;
}
#endif

/* USER CODE BEGIN FD_SPECIFIC_FUNCTIONS */

static void Manage_Service_Init(void)
{
  /* if P2P_server */
  if (global_svc_index == 1)
  {
    strcpy(global_name, "P2PSRV1");
    local_name_var[0] = AD_TYPE_COMPLETE_LOCAL_NAME;
    strcpy(&local_name_var[1], global_name);
    
    manuf_data[0] = sizeof(manuf_data)-1;
    manuf_data[1] = AD_TYPE_MANUFACTURER_SPECIFIC_DATA;
    manuf_data[2] = 0x01;
    manuf_data[3] = CFG_DEV_ID_P2P_SERVER1;
    manuf_data[4] = 0x00;
    manuf_data[5] = 0x00;
    manuf_data[6] = 0x00;
    manuf_data[7] = 0x00;
    manuf_data[8] = 0x00;
    manuf_data[9] = 0x00;
    manuf_data[10] = 0x00;
    manuf_data[11] = 0x00;
    manuf_data[12] = 0x00;
    manuf_data[13] = 0x00;
  }
  /* if Heart rate */
  else if (global_svc_index == 2)
  {
    strcpy(global_name, "HRSTM");
    local_name_var[0] = AD_TYPE_COMPLETE_LOCAL_NAME;
    strcpy(&local_name_var[1], global_name);

    manuf_data[0] = sizeof(manuf_data)-1;
    manuf_data[1] = AD_TYPE_MANUFACTURER_SPECIFIC_DATA;
    manuf_data[2] = 0x01;
    manuf_data[3] = 0x00;
    manuf_data[4] = 0x00;
    manuf_data[5] = 0x00;
    manuf_data[6] = 0x00;
    manuf_data[7] = 0x00;
    manuf_data[8] = 0x00;
    manuf_data[9] = 0x00;
    manuf_data[10] = 0x00;
    manuf_data[11] = 0x00;
    manuf_data[12] = 0x00;
    manuf_data[13] = 0x00;
  }

  SVCCTL_Init();

  Ble_Hci_Gap_Gatt_Init();

  if (global_svc_index == 1)
  {
  /**
   * Initialize P2P Server Application
   */
   P2PS_STM_Init();
   P2PS_APP_Init();
   /**
   * Make device discoverable
   */
   BleApplicationContext.BleApplicationContext_legacy.advtServUUID[0] = NULL;
   BleApplicationContext.BleApplicationContext_legacy.advtServUUIDlen = 0;

   /* Initialize intervals for reconnexion without intervals update */
   AdvIntervalMin = CFG_FAST_CONN_ADV_INTERVAL_MIN;
   AdvIntervalMax = CFG_FAST_CONN_ADV_INTERVAL_MAX;
  }
  else if (global_svc_index == 2)
  {
    /**
    * Initialize DIS Application
    */
    DISAPP_Init();
    /**
    * Initialize HRS Application
    */
    HRS_Init();
    HRSAPP_Init();
    /**
    * Make device discoverable
    */
    BleApplicationContext.BleApplicationContext_legacy.advtServUUID[0] = AD_TYPE_16_BIT_SERV_UUID;
    BleApplicationContext.BleApplicationContext_legacy.advtServUUIDlen = 1;
    Add_Advertisment_Service_UUID(HEART_RATE_SERVICE_UUID);

    /* Initialize intervals for reconnexion without intervals update */
    AdvIntervalMin = CFG_FAST_CONN_ADV_INTERVAL_MIN;
    AdvIntervalMax = CFG_FAST_CONN_ADV_INTERVAL_MAX;
  }
  
