STMicroelectronics/STM32CubeWB/Projects/P-NUCLEO-WB55.Nucleo/Applications/BLE/BLE_AT_Server/STM32_WPAN/App/app_ble.c
  Adv_Request(APP_BLE_FAST_ADV);
  
  return;
}

static void Manage_Start_Stop_Adv_Init(void)
{
  tBleStatus result;
 
  /* stop advertising */
  if (global_adv_enable == 0)
  {
    result = aci_gap_set_non_discoverable();
    if (result == BLE_STATUS_SUCCESS)
    {
      printf("non discoverable, Successfully \r\n\r");
    }
    else
    {
      printf("non discoverable, Failed \r\n\r");
    }
  }
  /* start advertising */
  else if (global_adv_enable == 1)
  {
    result = aci_gap_set_discoverable(global_adv_type, 
                                      global_adv_int_min, 
                                      global_adv_int_max, 
                                      global_ble_addr_type | global_ble_cfg_addr_type, 
                                      0x00, 
                                      strlen(local_name_var),
                                      (uint8_t*) &local_name_var,
                                      BleApplicationContext.BleApplicationContext_legacy.advtServUUIDlen,
                                      BleApplicationContext.BleApplicationContext_legacy.advtServUUID, 0x0000, 0x0000);
    if (result == BLE_STATUS_SUCCESS)
    {
      printf("set discoverable, Successfully \r\n\r");
    }
    else
    {
      printf("set discoverable, Failed 0x%x\r\n\r", result);
    }
  }
  
  return;
}

static void Manage_Custom_Service_Init(void)
{
  tBleStatus result = BLE_STATUS_INVALID_PARAMS;
  uint8_t service_uuid[16] = {0x8f, 0xe5, 0xb3, 0xd5, 0x2e, 0x7f, 0x4a, 0x98, 0x2a, 0x48, 0x7a, 0xcc, 0x00, 0x00, 0x00, 0x00};
  
  service_uuid[12] = (uint8_t)(global_svc_uuid);
  service_uuid[13] = (uint8_t)(global_svc_uuid >> 8);
  
  Custom_SVC_Init();
    
  if (global_svc_uuid_type == UUID_TYPE_16)
  {
    result = aci_gatt_add_service(global_svc_uuid_type, (Service_UUID_t *)&global_svc_uuid, 
                         PRIMARY_SERVICE, global_max_attr, &(Custom_Context.SvcHdle[global_svc_index - CUSTOM_APP_SVC_OFFSET]));
  }
  else if (global_svc_uuid_type == UUID_TYPE_128)
  {
    /* convert uuid_16b into uuid_128b */
    result = aci_gatt_add_service(global_svc_uuid_type, (Service_UUID_t *)service_uuid, 
                         PRIMARY_SERVICE, global_max_attr, &(Custom_Context.SvcHdle[global_svc_index - CUSTOM_APP_SVC_OFFSET]));
  }
  if (result == BLE_STATUS_SUCCESS)
  {
    printf("Add service, Successfully \r\n\r");
  }
  else
  {
    printf("Add service, Failed \r\n\r");
  }
  
  return;
}

static void Manage_Ble_Init(void)
{
  manuf_data[0] = sizeof(manuf_data)-1;
  manuf_data[1] = AD_TYPE_MANUFACTURER_SPECIFIC_DATA;
  manuf_data[2] = 0x01;
  manuf_data[3] = 0x00;
  manuf_data[4] = 0x00;
  manuf_data[5] = 0x00;
  manuf_data[6] = 0x00;
  manuf_data[7] = 0x00;
  manuf_data[8] = 0x00;
  manuf_data[9] = 0x00;
  manuf_data[10] = 0x00;
  manuf_data[11] = 0x00;
  manuf_data[12] = 0x00;
  manuf_data[13] = 0x00;
    
  Ble_Hci_Gap_Gatt_Init();
  
  return;
}

static void Manage_Charac_Init(void)
{
  tBleStatus result = BLE_STATUS_INVALID_PARAMS;
  uint8_t char_uuid[16] = {0x19, 0xed, 0x82, 0xae, 0xed, 0x21, 0x4c, 0x9d, 0x41, 0x45, 0x22, 0x8e, 0x00, 0x00, 0x00, 0x00};
  
  char_uuid[12] = (uint8_t)(global_char_uuid);
  char_uuid[13] = (uint8_t)(global_char_uuid >> 8);
  
  if (global_char_uuid_type == UUID_TYPE_16)
  {
    result = aci_gatt_add_char( Custom_Context.SvcHdle[global_svc_id - CUSTOM_APP_SVC_OFFSET], global_char_uuid_type, (Char_UUID_t *)&global_char_uuid, global_char_value_len,
                               global_char_properties, global_char_sec_permission, global_gatt_event_mask,
                               10, 1, &(Custom_Context.CharHdle[global_svc_id - CUSTOM_APP_SVC_OFFSET][global_char_id - 1]));
  }
  else if (global_char_uuid_type == UUID_TYPE_128)
  {
    /* convert uuid_16b into uuid_128b */
    result = aci_gatt_add_char( Custom_Context.SvcHdle[global_svc_id - CUSTOM_APP_SVC_OFFSET], global_char_uuid_type, (Char_UUID_t *)char_uuid, global_char_value_len,
                               global_char_properties, global_char_sec_permission, global_gatt_event_mask,
                               10, 1, &(Custom_Context.CharHdle[global_svc_id - CUSTOM_APP_SVC_OFFSET][global_char_id - 1]));
  }
  if (result == BLE_STATUS_SUCCESS)
  {
    printf("Add characteristic, Successfully \r\n\r");
  }
  else
  {
    printf("Add characteristic, Failed \r\n\r");
  }
  
  return;
}

static void Manage_Slave_Security_Request(void)
{
  tBleStatus result;
  
  result = aci_gap_slave_security_req(BleApplicationContext.BleApplicationContext_legacy.connectionHandle);
  if( result == BLE_STATUS_SUCCESS )
  {
    printf("Slave_security_req(), Successfully \r\n\r");
  }
  else
  {
    printf("Slave_security_req(), Failed \r\n\r");
  }
  
  return;
}

static void Manage_Pairing_Confirm_Answer(void)
{
  tBleStatus result;
  
  result = aci_gap_numeric_comparison_value_confirm_yesno(BleApplicationContext.BleApplicationContext_legacy.connectionHandle,
                                                           global_pairing_confirm);
  if( result == BLE_STATUS_SUCCESS )
  {
    printf("Pairing_Confirm_Answer(), Successfully \r\n\r");
  }
  else
  {
    printf("Pairing_Confirm_Answer(), Failed \r\n\r");
  }
  
  return;
}

static void Manage_Pass_Key_Resp(void)
{
  tBleStatus result;
  
  result = aci_gap_pass_key_resp(BleApplicationContext.BleApplicationContext_legacy.connectionHandle,
                                 global_pass_key_resp);
  
  if( result == BLE_STATUS_SUCCESS )
  {
    printf("Pass_Key_Resp(), Successfully \r\n\r");
  }
  else
  {
    printf("Pass_Key_Resp(), Failed \r\n\r");
  }
  
  return;
}

static void Manage_IO_Capability(void)
{
  tBleStatus result;
  
  result = aci_gap_set_io_capability(global_io_capability);
  if( result == BLE_STATUS_SUCCESS )
  {
    printf("IO_Capability(), Successfully \r\n\r");
  }
  else
  {
    printf("IO_Capability(), Failed \r\n\r");
  }
  
  return;
}

static void Manage_set_authen_req(void)
{
  tBleStatus result;
  
  result = aci_gap_set_authentication_requirement(global_bonding,global_mitm,global_scsupport,0x00,0x07,0x10,
                                                  global_usefixedpin,global_fixedpin,global_addrtype);
  if( result == BLE_STATUS_SUCCESS )
  {
    printf("set_authentication_req(), Successfully \r\n\r");
  }
  else
  {
    printf("set_authentication_req(), Failed \r\n\r");
  }
  
  return;
}

static void Manage_clear_db(void)
{
  tBleStatus result;
  
  result = aci_gap_clear_security_db();
  if( result == BLE_STATUS_SUCCESS )
  {
    printf("Clear_security_db(), Successfully \r\n\r");
  }
  else
  {
    printf("Clear_security_db(), Failed \r\n\r");
  }
  
  return;
}

static void Manage_hci_reset(void)
{
  hci_reset();
  
  return;
}

